read_verilog blink.v
synth_ice40 -top top
write_json blink.json
