read_verilog 7seg.v
synth_ice40 -top top
write_json 7seg.json
